## Pandas Day -9 ( Handling Missing Values using interpolate() )

### Pandas Interpolate ()
----------------------------------
Pnadas interpolate() function is basically used to fill NaN values in DataFrame and Series.

 - Very Powerfull Function
 - Uses various interpolation techniques

Syntax: 
    DataFrame.interpolate()
    Series.interpolate()
    
Parameters :  
- method  :: inplace  
- axis    :: limit_direction  
- limit   :: limit_area

In [49]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [50]:
df=pd.read_csv("student_10_day13.csv")

In [51]:
df.head()

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0
3  06-07-2019         NaN     11     NaN        0.0         NaN
4  07-07-2019      1005.0     11       A        4.0         NaN

### Linear Interpolation

In [52]:
df_linear = df.interpolate()
df_linear

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [53]:
df.interpolate(method='linear')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

### Interpolation with Method

In [54]:
df.interpolate(method='bfill')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10       A        3.0        80.0
2  03-07-2019      1005.0     10       A        3.0        60.0
3  06-07-2019      1005.0     11       A        0.0        80.0
4  07-07-2019      1005.0     11       A        4.0        80.0
5  08-07-2019      1007.0     11       D       10.0        80.0
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        6.0        90.0
8  11-07-2019      1009.0     12       A        6.0        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

### Changing the ['Date'] type to Date

In [55]:
df=pd.read_csv("student_10_day13.csv",parse_dates=['Date'])

In [56]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [57]:
df=pd.read_csv("student_10_day13.csv",parse_dates=['Date'],index_col=['Date'])

In [58]:
df.head()

            Student ID  Class Section  Study hrs  Percentage
Date
2019-01-07      1001.0     10       A        2.0        50.0
2019-02-07      1002.0     10     NaN        NaN        80.0
2019-03-07         NaN     10     NaN        3.0        60.0
2019-06-07         NaN     11     NaN        0.0         NaN
2019-07-07      1005.0     11       A        4.0         NaN

### Interpolation with Method 'time'

In [59]:
df.interpolate(method='time')

            Student ID  Class Section  Study hrs  Percentage
Date
2019-01-07     1001.00     10       A   2.000000   50.000000
2019-02-07     1002.00     10     NaN   2.525424   80.000000
2019-03-07     1002.56     10     NaN   3.000000   60.000000
2019-06-07     1004.40     11     NaN   0.000000   70.000000
2019-07-07     1005.00     11       A   4.000000   73.260870
2019-08-07     1006.00     11       D  10.000000   76.630435
2019-09-07     1007.00     12       B   4.000000   80.000000
2019-10-07     1008.00     12       C   4.659341   90.000000
2019-11-07     1009.00     12       A   5.340659   60.000000
2019-12-07     1010.00     12       D   6.000000   85.000000

### Interpolation with index method

In [60]:
df=pd.read_csv("student_10_day13.csv",index_col='Class')

In [61]:
df.interpolate(method='index')

             Date  Student ID Section  Study hrs  Percentage
Class
10     01-07-2019      1001.0       A        2.0        50.0
10     02-07-2019      1002.0     NaN        3.0        80.0
10     03-07-2019      1002.0     NaN        3.0        60.0
11     06-07-2019      1005.0     NaN        0.0        70.0
11     07-07-2019      1005.0       A        4.0        70.0
11     08-07-2019      1005.0       D       10.0        70.0
12     09-07-2019      1007.0       B        4.0        80.0
12     10-07-2019      1008.0       C        6.0        90.0
12     11-07-2019      1009.0       A        6.0        60.0
12     12-07-2019      1010.0       D        6.0        85.0

### Interpolation with Method 'polynomial'

In [62]:
df=pd.read_csv("student_10_day13.csv")

In [63]:
df.interpolate(method='polynomial',order=3)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000   50.000000
1  02-07-2019      1002.0     10     NaN   6.515495   80.000000
2  03-07-2019      1003.0     10     NaN   3.000000   60.000000
3  06-07-2019      1004.0     11     NaN   0.000000   46.698620
4  07-07-2019      1005.0     11       A   4.000000   48.251534
5  08-07-2019      1006.0     11       D  10.000000   60.678681
6  09-07-2019      1007.0     12       B   4.000000   80.000000
7  10-07-2019      1008.0     12       C  -7.203326   90.000000
8  11-07-2019      1009.0     12       A -10.804989   60.000000
9  12-07-2019      1010.0     12       D   6.000000   85.000000

### Interpolation with Method 'nearest'

In [64]:
df.interpolate(method='nearest')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        2.0        80.0
2  03-07-2019      1002.0     10     NaN        3.0        60.0
3  06-07-2019      1005.0     11     NaN        0.0        60.0
4  07-07-2019      1005.0     11       A        4.0        60.0
5  08-07-2019      1005.0     11       D       10.0        80.0
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        4.0        90.0
8  11-07-2019      1009.0     12       A        6.0        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

### Interpolation with Limit

In [73]:
df.interpolate(limit=2)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000         NaN
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

### Interpolation with Direction

In [74]:
df.interpolate(limit_direction='backward')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [75]:
df.interpolate(limit_direction='both')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [76]:
df.interpolate(limit_area='inside')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [77]:
df.interpolate(limit_area='outside') ## extrapolate values

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0
3  06-07-2019         NaN     11     NaN        0.0         NaN
4  07-07-2019      1005.0     11       A        4.0         NaN
5  08-07-2019         NaN     11       D       10.0         NaN
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        NaN        90.0
8  11-07-2019      1009.0     12       A        NaN        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

In [72]:
df.interpolate(limit_area='inside')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0